In [1]:
import pandas as pd
import requests

In [3]:
donors2008_to_load = "Resources/donors2008.csv"

In [4]:
donors2008_df = pd.read_csv("Resources/donors2008.csv")
donors2008_df.head()

  LastName FirstName          Employer      City State    Zip  Amount  FIELD8
0    Aaron    Eugene  State Department    Dulles    VA  20189   500.0     NaN
1    Abadi   Barbara       Abadi & Co.  New York    NY  10021   200.0     NaN
2  Adamany   Anthony           Retired  Rockford    IL  61103   500.0     NaN
3    Adams  Lorraine              Self  New York    NY  10026   200.0     NaN
4    Adams    Marion              None    Exeter    NH  03833   100.0     NaN

In [10]:
donnors2008_state_count = donors2008_df.groupby(["State"]).count()["Amount"]
donnors2008_state_count

State
AE      1
AK      6
AL      8
AP      1
AR      5
AZ     25
CA    366
CO     40
CT     35
DC     52
DE      5
FL     78
GA     26
HI     11
IA      5
ID      6
IL    104
IN      8
KS      9
KY     10
LA      6
MA     70
MD     85
ME      9
MI     27
MN     25
MO     18
MS      3
MT      6
NC     40
NE      3
NH      8
NJ     45
NM     23
NV     15
NY    199
OH     16
OK      6
OR     19
PA     45
QC      1
RI      9
SC     10
TN     14
TX     88
UT      2
VA    101
VI      2
VT      9
WA     54
WI     12
WV      3
WY      2
Name: Amount, dtype: int64

In [11]:
donnors2008_state_sum = donors2008_df.groupby(["State"]).sum()["Amount"]
donnors2008_state_sum

State
AE       100.00
AK      1050.00
AL      1700.00
AP       200.00
AR      1750.00
AZ      5150.00
CA    250796.00
CO     34050.00
CT     28900.00
DC     33650.00
DE       950.00
FL     55330.00
GA     21900.00
HI      2150.00
IA      3000.00
ID      2050.00
IL    115910.00
IN      1800.00
KS      2550.00
KY      7350.00
LA       950.00
MA     52550.00
MD     69685.00
ME      1900.00
MI      6525.00
MN     17425.00
MO      8350.00
MS      3625.00
MT      1200.00
NC     17625.00
NE       550.00
NH      2950.00
NJ     12425.00
NM      6875.00
NV      5900.00
NY    181255.00
OH      8025.00
OK      1200.00
OR      6100.00
PA     40354.00
QC       250.00
RI      6300.00
SC      2875.00
TN      3600.00
TX     42697.00
UT       400.00
VA     70810.44
VI       450.00
VT      3150.00
WA     21575.00
WI      2225.00
WV       550.00
WY       250.00
Name: Amount, dtype: float64

In [12]:
donnors2008_State_avg= donnors2008_state_sum/ donnors2008_count
donnors2008_State_avg

State
AE     100.000000
AK     175.000000
AL     212.500000
AP     200.000000
AR     350.000000
AZ     206.000000
CA     685.234973
CO     851.250000
CT     825.714286
DC     647.115385
DE     190.000000
FL     709.358974
GA     842.307692
HI     195.454545
IA     600.000000
ID     341.666667
IL    1114.519231
IN     225.000000
KS     283.333333
KY     735.000000
LA     158.333333
MA     750.714286
MD     819.823529
ME     211.111111
MI     241.666667
MN     697.000000
MO     463.888889
MS    1208.333333
MT     200.000000
NC     440.625000
NE     183.333333
NH     368.750000
NJ     276.111111
NM     298.913043
NV     393.333333
NY     910.829146
OH     501.562500
OK     200.000000
OR     321.052632
PA     896.755556
QC     250.000000
RI     700.000000
SC     287.500000
TN     257.142857
TX     485.193182
UT     200.000000
VA     701.093465
VI     225.000000
VT     350.000000
WA     399.537037
WI     185.416667
WV     183.333333
WY     125.000000
Name: Amount, dtype: float64

In [20]:
import matplotlib as plt

In [19]:
avg_rain_state_to_load = "avg_rain_state.csv"

In [21]:
avg_rain_state_df = pd.read_csv("Resources/avg_rain_state.csv")
avg_rain_state_df.head()

        State  Inches  Milli­metres  Rank
0     Alabama    58.3          1480     4
1      Alaska    22.5           572    39
2     Arizona    13.6           345    47
3    Arkansas    50.6          1284     8
4  California    22.2           563    40

In [23]:
avg_rain_state_df.keys()

Index(['State', 'Inches', 'Milli­metres', 'Rank'], dtype='object')

In [31]:
avg_rain_state_df_total_sum= avg_rain_state_df['Inches'].mode()
avg_rain_state_df_total_sum

0    28.9
1    42.2
2    50.3
dtype: float64

In [ ]:
import